In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
dict1 = {
    "name":['harry', 'rohan', 'Priyanka', 'Shubh'],
    "marks": [92,56, 85, 76],
    "city": ["rampur", "Pune", "Mumbai", "Austin"]
}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

       name  marks    city
0     harry     92  rampur
1     rohan     56    Pune
2  Priyanka     85  Mumbai
3     Shubh     76  Austin

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   marks   4 non-null      int64
 2   city    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [8]:
df.columns

Index(['name', 'marks', 'city'], dtype='object')

In [9]:
df.info

<bound method DataFrame.info of        name  marks    city
0     harry     92  rampur
1     rohan     56    Pune
2  Priyanka     85  Mumbai
3     Shubh     76  Austin>

In [10]:
#convert to csv

In [12]:
df.to_csv('friends.csv')

In [13]:
#index

In [14]:
df.to_csv('friends_index_false.csv', index=False)

In [15]:
df.head()

       name  marks    city
0     harry     92  rampur
1     rohan     56    Pune
2  Priyanka     85  Mumbai
3     Shubh     76  Austin

In [16]:
df.head(2)

    name  marks    city
0  harry     92  rampur
1  rohan     56    Pune

In [17]:
df.tail()

       name  marks    city
0     harry     92  rampur
1     rohan     56    Pune
2  Priyanka     85  Mumbai
3     Shubh     76  Austin

In [18]:
df.tail(2)

       name  marks    city
2  Priyanka     85  Mumbai
3     Shubh     76  Austin

In [19]:
df.describe()

           marks
count   4.000000
mean   77.250000
std    15.607156
min    56.000000
25%    71.000000
50%    80.500000
75%    86.750000
max    92.000000

In [20]:
data = pd.read_csv('friends_index_false.csv')

In [21]:
data

       name  marks    city
0     harry     92  rampur
1     rohan     56    Pune
2  Priyanka     85  Mumbai
3     Shubh     76  Austin

In [23]:
data['name']

0       harry
1       rohan
2    Priyanka
3       Shubh
Name: name, dtype: object

In [24]:
#change index

In [27]:
data.index = ['first', 'second', 'third','fourth']

In [28]:
data

            name  marks    city
first      harry     92  rampur
second     rohan     56    Pune
third   Priyanka     85  Mumbai
fourth     Shubh     76  Austin